import ACBanner from '@/assets/music/爱错.png'
import AcMp3 from '@/assets/music/爱错.mp3'
import TDLLBanner from '@/assets/music/天地龙鳞.png'
import TDLLMp3 from '@/assets/music/天地龙鳞.mp3'
import RJZYZMp3 from '@/assets/music/人间这一遭.mp3'
import RJZYZBanner from '@/assets/music/人间这一遭.png'
import LUOMp3 from '@/assets/music/落.mp3'
import LUOBanner from '@/assets/music/落.png'
import YYXMp3 from '@/assets/music/鸳鸯戏.mp3';
import YYXBanner from '@/assets/music/鸳鸯戏.webp';

export interface MusicConstType {
  rawLyrics: string,
  name: string,
  singer: string,
  banner: string,
  music: string,
}

export const MusicConst:MusicConstType[] = [
  {
    rawLyrics:`[00:00.0]鸳鸯戏 (DJ南瓜饼版) - Babystop_山竹/伊笑/南瓜饼
[00:00.21]词：家浚
[00:00.25]曲：家浚/乐金震
[00:00.32]编曲：孙星辰
[00:00.34]哎呦小娘子你莫忧
[00:04.36]待到春来又雪满楼
[00:08.52]不负天长不负地久
[00:12.4]你我白首
[01:30.38]烛灯下的旧情意谁理
[01:32.58]西窗外的良人泣不易
[01:34.66]举杯谁和明月提起她在远方等你
[01:38.869995]等你再落下几笔
[01:40.94]等你再弹奏几曲
[01:43.020004]等你再回到故里等你金榜把名题
[01:47.46]砚上三五笔
[01:51.6]落墨鹧鸪啼
[01:55.7]谁识曲中意
[02:00.14]断弦等你系
[02:03.0]哎呦小情郎你莫愁
[02:07.21]此生只为你挽红袖
[02:11.32]三巡酒过月上枝头
[02:15.23]我心悠悠
[02:19.68]哎呦小娘子你莫忧
[02:23.88]待到春来又雪满楼
[02:27.99]不负天长不负地久
[02:31.92]你我白首
[02:36.62]哎呦小情郎你莫愁
[02:40.54001]此生只为你挽红袖
[02:44.7]三巡酒过月上枝头
[02:48.56]我心悠悠
[02:53.04001]哎呦小娘子你莫忧
[02:57.19]待到春来又雪满楼
[03:01.46]不负天长不负地久
[03:05.22]你我白首`,
    name:'鸳鸯戏',
    singer:'Babystop_山竹&伊笑',
    banner:YYXBanner,
    music:YYXMp3
  },
  {
    rawLyrics:`[00:00.03]落 (花开花落日升日没) - 唐伯虎Annie
[00:02.22]词 Lyrics：潇然
[00:02.99]曲 Composed：潇然
[00:03.75]编曲 Arranger：罗刚
[00:04.68]制作人Produced：潇然
[00:05.74]和声 Backing vocals：唐伯虎Annie/柏鹿
[00:07.38]录音师 Recording Engineer：吴天宇
[00:08.63]录音棚 Recording Studio：Leader Music Studio
[00:09.91]混音师 Mixing Engineer：姜冉
[00:11.04]母带处理 Mastering Engineer：姜冉
[00:12.36]监制 Executive producer：靖成@爱粉扑
[00:13.23]企划 Planner：枨乐企划
[00:13.25]统筹 Project Lead：爱粉扑音乐
[00:13.28]出品人Publisher：靖成@爱粉扑
[00:13.31]营销协力 Marketing collaboration：隋冬雪/可可豆/派大星
[00:13.36]营销统筹 Marketing coordination：黄才娟/胡皓/荣儿
[00:13.4]营销推广机构 Marketing and promotion agencies：百纳娱乐/网益文化
[00:13.46]OP：爱粉扑音乐
[00:13.47]SP：百纳娱乐
[00:13.49]是谁从夜拽下一缕光
[00:19.47]将那已沉寂的心扰乱
[00:25.46]明月高悬微风与星穿
[00:30.39]听哀叹 红颜
[00:36.31]随了了红尘 化作阑珊
[00:42.32]草长莺飞 长命落
[00:48.32]爱两两三三 思却总常常
[00:53.91]随流年 漂泊
[01:00.0]花开花落 日升日没
[01:02.93]真情如烟波
[01:05.93]人只知寂寞
[01:08.05]谁在乎因果
[01:11.96]潮起潮落 月圆月没
[01:14.91]看破不说破
[01:17.99]太单薄 与谁能说
[01:48.53]随了了红尘 化作阑珊
[01:54.36]草长莺飞 长命落
[02:00.28]爱两两三三 思却总常常
[02:05.95]随流年 漂泊
[02:12.04]花开花落 日升日没
[02:14.92]真情如烟波
[02:17.95]人只知寂寞
[02:20.22]谁在乎因果
[02:23.94]潮起潮落 月圆月没
[02:26.97]看破不说破
[02:29.95]太单薄 与谁能说
[02:36.04001]花开花落 日升日没
[02:38.88]真情如烟波
[02:41.98]人只知寂寞
[02:44.11]谁在乎因果
[02:47.93]潮起潮落 月圆月没
[02:50.9]看破不说破
[02:53.82]太单薄 与谁能说`,
    name:'落',
    singer:'唐伯虎Annie',
    music:LUOMp3,
    banner:LUOBanner
  },
  {
    rawLyrics: `[00:00.0]人间这一遭（人生这一杯酒啊）-木杰
[00:02.61]作词：木杰
[00:03.92]作曲：木杰
[00:05.23]编曲：木杰
[00:06.54]录音：木杰
[00:07.84]和声：木杰
[00:09.15]混音：陈阿晓
[00:10.46]企划：龙小晨
[00:11.77]推广：久居
[00:13.08]出品：Find Gold 计划
[00:14.38]OP：辣椒音娱
[00:15.69]【未经著作权人许可不得翻唱翻录或使用】
[00:17.01]时光匆匆地走啊走
[00:20.46]可曾为谁而停留
[00:23.88]多少光阴似水东流
[00:27.75]却带不走哀与愁
[00:30.69]岁月无声地偷啊偷
[00:34.2]偷偷染白了少年头
[00:37.65]跌跌撞撞半生已过
[00:41.91]多少遗憾心中留
[00:44.43]人生这一杯酒啊
[00:47.91]只要一喝就上头
[00:51.36]百般滋味皆入口
[00:54.75]烂醉红尘才方休
[00:58.14]人生这一杯酒啊
[01:01.62]醉在其中怎看透
[01:05.01]我且干了你随意
[01:09.33]人间一遭已足够
[01:25.56]岁月无声地偷啊偷
[01:29.07]偷偷染白了少年头
[01:32.490005]跌跌撞撞半生已过
[01:36.75]多少遗憾心中留
[01:39.270004]人生这一杯酒啊
[01:42.78]只要一喝就上头
[01:46.2]百般滋味皆入口
[01:49.619995]烂醉红尘才方休
[01:52.979996]人生这一杯酒啊
[01:56.46]醉在其中怎看透
[01:59.880005]我且干了你随意
[02:04.2]人间一遭已足够
[02:06.72]人生这一杯酒啊
[02:10.2]只要一喝就上头
[02:13.65]百般滋味皆入口
[02:17.04001]烂醉红尘才方休
[02:20.43]人生这一杯酒啊
[02:23.91]醉在其中怎看透
[02:27.3]我且干了你随意
[02:31.62]人间一遭已足够`,
    name: '人间这一遭',
    singer: '木杰',
    banner: RJZYZBanner,
    music: RJZYZMp3,
  },
  {
    rawLyrics: `[00:00.000]爱错 - 王力宏 (Leehom Wang)
[00:04.900]词：王力宏/崔惟楷
[00:09.810]曲：王力宏
[00:14.720]北风毫不留情
[00:18.730]把叶子吹落
[00:21.129]脆弱的她选择了逃脱
[00:27.602]叶子失去消息
[00:30.219]风才感觉寂寞
[00:36.396]整个冬天 北风的痛没人能说
[00:46.094]我从来没想过我会这样做
[00:52.895]从来没爱过所以爱错
[00:59.467]我从哪里起飞
[01:02.896]从哪里降落
[01:06.026]多少不能原谅的错
[01:09.555]却不能重来过
[01:20.155]翻开回忆角落完美的生活
[01:26.715]以为幸福都可以掌握
[01:33.235]仔细回味当初那个故事背后
[01:42.055]Oh 原来是我 原来是我
[01:45.785]犯下从没承认的错
[01:51.875]我从来没想过我会这样做
[01:58.585]从来没爱过所以爱错
[02:04.844]我从哪里起飞从哪里降落
[02:11.814]多少不能原谅的错
[02:15.104]却不能重来过
[02:23.014]在这少了你的世界 Oh
[02:29.694]找不回那些感觉
[02:34.283]其实我不想道别那些过去
[02:44.213]我从来没想过我会这样做
[02:51.283]从来没爱过所以爱错
[02:55.983]从来没有爱过那么认真
[02:58.123]我从哪里起飞
[03:00.863]从哪里降落
[03:04.452]多少不能原谅的错
[03:07.702]却不能重
[03:10.262]我从来没想过我会这样做
[03:17.601]从来没爱过所以爱错
[03:24.001]我从哪里起飞
[03:27.341]从哪里降落
[03:30.731]多少不能原谅的错
[03:34.071]请你原谅我的爱错`,
    name: '爱错',
    singer: '王力宏',
    banner: ACBanner,
    music: AcMp3,
  },
  {
    rawLyrics: `
[00:00.000]天地龙鳞 - 王力宏
[00:00.567]词：方文山
[00:00.675]曲：王力宏
[00:18.833]这江山我起笔 民族血脉又几万里
[00:26.451]几世纪六百年里
[00:30.269]龙的传人历经风雨
[00:33.878]这京畿中轴地 一如君子气节不移
[00:41.484]九龙壁瓦上琉璃
[00:45.140]历史从这衰落又崛起
[00:48.969]这龙鳞却曾经 铿锵落地犹如碎冰
[00:56.433]一片鳞一寸心 故事飘摇我不忍听
[01:03.967]人守礼心守静 悠扬古琴弹君子心
[01:11.382]我清醒等回音 盘旋泱泱华夏文明
[01:20.917]敬过去我落笔 东方辽阔的黄土地
[01:28.276]山水里泼墨抹去
[01:31.950]只见嶙峋华夏骨气
[01:35.793]紫禁城神武门
[01:39.587]多少沧桑铸造中华魂
[01:43.305]我继承文化深耕
[01:47.008]突破变局去扭转乾坤
[01:52.698]这龙鳞却曾经 铿锵落地犹如碎冰
[02:00.129]一片鳞一寸心 以小成其大我坚信
[02:07.694]将民族的命运 昂首抬起再次复兴
[02:15.112]游天地寻龙鳞 龙的血脉蔚然成林
[02:37.714]这龙鳞却曾经 铿锵落地犹如碎冰
[02:45.188]一片鳞一寸心 故事飘摇我不忍听
[02:52.661]将民族的命运 昂首抬起再次复兴
[03:00.136]游天地寻龙鳞 龙的血脉蔚然成林
[03:16.000]
`,
    name: '天地龙鳞',
    singer: '王力宏',
    banner: TDLLBanner,
    music: TDLLMp3,
  },
]